```
INITIAL = {
    # Base functionality
    'ㄱ': 'ㄱ',
    'ㄱㅇ': 'ㄲ',
    'ㄴ': 'ㄴ',
    'ㄷ': 'ㄷ',
    'ㄷㅇ': 'ㄸ',
    'ㄹ': 'ㄹ',
    'ㅁ': 'ㅁ',
    'ㅂ': 'ㅂ',
    'ㅇㅂ': 'ㅃ',
    'ㅅ': 'ㅅ',
    'ㅇㅅ': 'ㅆ',
    '': 'ㅇ',
    'ㅈ': 'ㅈ',
    'ㅈㅇ': 'ㅉ',
    'ㅎㅈ': 'ㅊ',
    'ㅎㄱ': 'ㅋ',
    'ㅎㄷ': 'ㅌ',
    'ㅎㅂ': 'ㅍ',
    'ㅎ': 'ㅎ'
}

MEDIAL = {
    # Base functionality
    'ㅏ': 'ㅏ',
    'ㅏㅣ': 'ㅐ',
    'ㅏ*': 'ㅑ',
    'ㅏ*ㅓ': 'ㅒ',
    'ㅓ': 'ㅓ',
    'ㅓㅣ': 'ㅔ',
    '*ㅓ': 'ㅕ',
    'ㅗㅓㅣ': 'ㅖ',
    'ㅗ': 'ㅗ',
    'ㅗㅏ': 'ㅘ',
    'ㅗㅏㅣ': 'ㅙ',
    'ㅗㅣ': 'ㅚ',
    'ㅗ*': 'ㅛ',
    'ㅜ': 'ㅜ',
    'ㅜㅓ': 'ㅝ',
    'ㅜㅓㅣ': 'ㅞ',
    'ㅜㅣ': 'ㅟ',
    'ㅜ*': 'ㅠ',
    'ㅏㅓ': 'ㅡ',
    'ㅏㅓㅣ': 'ㅢ',
    'ㅣ': 'ㅣ'
}
```